var line3 = [{ position: [120.141204, 30.265614], name: '黄龙洞站' }, { position: [120.128672, 30.267973], name: '黄龙体育中心站' }, { position: [120.122835, 30.270641], name: '古荡站' }, 
{ position: [120.11304, 30.270613], name: '古荡新村站' }, { position: [120.102129, 30.265239], name: '古墩路站' }, { position: [120.090872, 30.26261], name: '东岳站' }, { position: [120.076806, 30.260761], name: '花坞站' },
 { position: [120.058916, 30.252536], name: '西溪湿地南站' },{ position: [120.049861,30.248213], name: '洪园站' },{ position: [120.03091,30.243766], name: '联胜路站' },
 { position: [120.019401,30.242848], name: '高教路站' },{ position: [120.008085,30.246912], name: '全丰站' },{ position: [120.002616,30.260695], name: '创明路站' },
 { position: [119.980751,30.273756], name: '文一西路站' },{ position: [119.983238,30.288565], name: '龙舟路站' },{ position: [119.986848,30.294767], name: '杭州西站站' },{ position: [119.981915,30.305208], name: '留祥路站' },
 { position: [119.980316,30.311399], name: '吴山前站' },{ position: [120.051996,30.241687], name: '留下站' },{ position: [120.037461,30.222991], name: '屏峰站' },{ position: [120.021716,30.212592], name: '小和山站' },
 { position: [120.010705,30.2067], name: '石马站' }]

var line4 = [{ position: [120.141204, 30.265614], name: '汽车南站站' },{ position: [120.141204, 30.265614], name: '祥瑛路站' },{ position: [120.141204, 30.265614], name: '闻堰滨江站' },{ position: [120.141204, 30.265614], name: '闻堰站' },
{ position: [120.036335,30.331616], name: '杭州大学云谷站' },{ position: [120.020882,30.332126], name: '顾家塘站' },{ position: [120.019051,30.324196], name: '西舍里站' },{ position: [120.018789,30.313136], name: '高桥村站' },
{ position: [120.005746,30.314152], name: '田村里站' },{ position: [120.0008,30.310174], name: '龚家斗站' },{ position: [119.981723,30.304941], name: '留祥西路站' },{ position: [119.96799,30.306775], name: '连具塘（？）' }]

var line5 = [{ position: [119.946379,30.260089], name: '老余杭站' },{ position: [119.901933,30.260307], name: '之江实验室站' }]

var line7 = [{ position: [120.200409,30.247378], name: '观音塘站' },{ position: [120.18688,30.2431], name: '莫邪塘站' },{ position: [120.182685,30.238201], name: '滨江金地御品站' },
{ position: [120.164607,30.239972], name: '吴山广场站' }]

var line8 = [{ position: [120.563902,30.291568], name: '党农线站' },{ position: [120.603218,30.294408], name: '临江站' },{ position: [120.370977,30.292727], name: '21号大街站' },{ position: [120.355495,30.292662], name: '11号大街站' },
{ position: [120.333855,30.294894], name: '1号大街站' },{ position: [120.322804,30.30036], name: '金沙湖南站' },{ position: [120.300782,30.299161], name: '八堡站' },{ position: [120.270902,30.303885], name: '九睦路站' },
{ position: [120.236788,30.309438], name: '浜河站' },{ position: [120.219708,30.309229], name: '草庄站' },{ position: [120.207541,30.30859], name: '水敦站' },{ position: [120.193008,30.309489], name: '省农科院站' },
{ position: [120.164276,30.306187], name: '三塘站' },{ position: [120.127437,30.309047], name: '登云路站' },{ position: [120.126736,30.322761], name: '水宫桥站' },{ position: [120.096366,30.328885], name: '丰庆路站' },
{ position: [120.106121,30.346134], name: '金昌路站' },{ position: [120.088597,30.359972], name: '勾庄站' },{ position: [120.08451,30.367739], name: '勾庄北站（？）' },{ position: [120.059524,30.369346], name: '网周路站' },
{ position: [120.048167,30.368998], name: '良渚东站' },{ position: [120.038801,30.369137], name: '良渚北站' }]